Revit 2024 API
DeleteWorksetSettings Class
 This class represents the settings used to delete a workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public class DeleteWorksetSettings : IDisposable
Visual Basic
Public Class DeleteWorksetSettings _
	Implements IDisposable
Visual C++
public ref class DeleteWorksetSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DeleteWorksetSettings
See Also
DeleteWorksetSettings Members
Autodesk.Revit.DB Namespace